app/controllers/users_controller.rb

INSERT INTO `users` (`user_name`, `password_digest`, `email`, `created_at`, `updated_at`) VALUES ('rajesh', '$2a$10$fto5bs1tqc6woo/eyKrwUu0sooz/SqOPSfgR3sDOPN1h6SpzQ0h8W', 'abc@example.com', '2016-03-17 07:26:47', '2016-03-17 07:26:47')
---
	def create
		@user = User.new
		@user.user_name = params[:user][:user_name]
		@user.password = params[:user][:password]
		@user.email = params[:user][:email]
		if @user.save